# **Setup**

In [24]:
# Load SQL extension For Jupyter Notebook
# %load_ext sql
%reload_ext sql

# Connect to the database
%sql postgresql://postgres:<password>@localhost:5432/HR_Database

Connecting and switching to connection 'postgresql://postgres:***@localhost:5432/HR_Database'

In [63]:
%%sql 

SELECT * FROM pg_catalog.pg_tables
WHERE schemaname = 'public'

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

5 rows affected.

+------------+-------------+------------+------------+------------+----------+-------------+-------------+
| schemaname |  tablename  | tableowner | tablespace | hasindexes | hasrules | hastriggers | rowsecurity |
+------------+-------------+------------+------------+------------+----------+-------------+-------------+
|   public   | departments |  postgres  |    None    |    True    |  False   |     True    |    False    |
|   public   |  employees  |  postgres  |    None    |    True    |  False   |     True    |    False    |
|   public   |    titles   |  postgres  |    None    |    True    |  False   |     True    |    False    |
|   public   |   history   |  postgres  |    None    |    True    |  False   |     True    |    False    |
|   public   |   salaries  |  postgres  |    None    |    True    |  False   |     True    |    False    |
+------------+-------------+------------+------------+------------+----------+-------------+-------------+

# **Database Table Preview**

## **Departments**

In [79]:
%sql SELECT * FROM departments

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+----+--------------------------+
| id |           name           |
+----+--------------------------+
| 1  |     Human Resources      |
| 2  |         Finance          |
| 3  |        Marketing         |
| 4  |            IT            |
| 5  |        Operations        |
| 6  |          Sales           |
| 7  |     Customer Service     |
| 8  | Research and Development |
| 9  |          Legal           |
| 10 |      Administration      |
+----+--------------------------+
Truncated to displaylimit of 10.

## **Employees**

In [80]:
%sql SELECT * FROM employees

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

2000 rows affected.

+----+-------------+-----------+-----------------------------+------------+----------+---------------+
| id |  first_name | last_name |            email            | hire_date  | title_id | department_id |
+----+-------------+-----------+-----------------------------+------------+----------+---------------+
| 1  |   Samantha  |   Miller  | samantha.miller@example.com | 2022-06-18 |    3     |       2       |
| 2  |     John    |    Hall   |    john.hall@example.com    | 2021-11-19 |    3     |       8       |
| 3  |     Jane    |   Wilson  |   jane.wilson@example.com   | 2021-05-31 |    8     |       8       |
| 4  |   Michael   |  Johnson  | michael.johnson@example.com | 2023-06-21 |    5     |       8       |
| 5  |     John    |   Wilson  |   john.wilson@example.com   | 2022-06-05 |    10    |       6       |
| 6  |   Samantha  |   Miller  | samantha.miller@example.com | 2023-01-28 |    2     |       5       |
| 7  |    Daniel   |   Miller  |  daniel.miller@example.com  | 2021-04-13 |    10    |       10      |
| 8  | Christopher |    Lee    | christopher.lee@example.com | 2020-02-21 |    6     |       8       |
| 9  |    Emily    |    Lee    |    emily.lee@example.com    | 2019-06-05 |    6     |       9       |
| 10 |    Olivia   |   Smith   |   olivia.smith@example.com  | 2023-06-30 |    4     |       6       |
+----+-------------+-----------+-----------------------------+------------+----------+---------------+
Truncated to displaylimit of 10.

## **Titles**

In [82]:
%sql SELECT * FROM titles

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+----+-------------------+
| id |        name       |
+----+-------------------+
| 1  | Software Engineer |
| 2  |    Data Analyst   |
| 3  |  Project Manager  |
| 4  |   UI/UX Designer  |
| 5  |   Database Admin  |
| 6  |   System Analyst  |
| 7  |  Network Engineer |
| 8  |  Business Analyst |
| 9  |     QA Tester     |
| 10 |   IT Consultant   |
+----+-------------------+
Truncated to displaylimit of 10.

## **Histories**

In [84]:
%sql SELECT * FROM history

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

2000 rows affected.

+----+------------+------------+-------------+----------+---------------+
| id | start_date |  end_date  | employee_id | title_id | department_id |
+----+------------+------------+-------------+----------+---------------+
| 1  | 2022-06-18 | 2023-11-18 |      1      |    6     |       2       |
| 2  | 2021-11-19 | 2023-11-18 |      2      |    5     |       10      |
| 3  | 2021-05-31 | 2023-11-18 |      3      |    10    |       5       |
| 4  | 2023-06-21 | 2023-11-18 |      4      |    9     |       9       |
| 5  | 2022-06-05 | 2023-11-18 |      5      |    5     |       4       |
| 6  | 2023-01-28 | 2023-11-18 |      6      |    7     |       3       |
| 7  | 2021-04-13 | 2023-11-18 |      7      |    9     |       10      |
| 8  | 2020-02-21 | 2023-11-18 |      8      |    3     |       10      |
| 9  | 2019-06-05 | 2023-11-18 |      9      |    9     |       2       |
| 10 | 2023-06-30 | 2023-11-18 |      10     |    9     |       2       |
+----+------------+------------+-------------+----------+---------------+
Truncated to displaylimit of 10.

## **Salaries**

In [85]:
%sql SELECT * FROM salaries

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

2003 rows affected.

+----+--------+------------+------------+-------------+
| id | salary | start_date |  end_date  | employee_id |
+----+--------+------------+------------+-------------+
| 2  | 72523  | 2021-11-19 | 2023-11-18 |      2      |
| 3  | 66152  | 2021-05-31 | 2023-11-18 |      3      |
| 4  | 97737  | 2023-06-21 | 2023-11-18 |      4      |
| 5  | 71131  | 2022-06-05 | 2023-11-18 |      5      |
| 6  | 96584  | 2023-01-28 | 2023-11-18 |      6      |
| 7  | 82327  | 2021-04-13 | 2023-11-18 |      7      |
| 8  | 84089  | 2020-02-21 | 2023-11-18 |      8      |
| 9  | 85333  | 2019-06-05 | 2023-11-18 |      9      |
| 10 | 63603  | 2023-06-30 | 2023-11-18 |      10     |
| 11 | 88726  | 2023-02-05 | 2023-11-18 |      11     |
+----+--------+------------+------------+-------------+
Truncated to displaylimit of 10.

# **01 -Top 10 Earners**

In [34]:
%%sql 
SELECT * FROM salaries

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

2003 rows affected.

+----+--------+------------+------------+-------------+
| id | salary | start_date |  end_date  | employee_id |
+----+--------+------------+------------+-------------+
| 2  | 72523  | 2021-11-19 | 2023-11-18 |      2      |
| 3  | 66152  | 2021-05-31 | 2023-11-18 |      3      |
| 4  | 97737  | 2023-06-21 | 2023-11-18 |      4      |
| 5  | 71131  | 2022-06-05 | 2023-11-18 |      5      |
| 6  | 96584  | 2023-01-28 | 2023-11-18 |      6      |
| 7  | 82327  | 2021-04-13 | 2023-11-18 |      7      |
| 8  | 84089  | 2020-02-21 | 2023-11-18 |      8      |
| 9  | 85333  | 2019-06-05 | 2023-11-18 |      9      |
| 10 | 63603  | 2023-06-30 | 2023-11-18 |      10     |
| 11 | 88726  | 2023-02-05 | 2023-11-18 |      11     |
+----+--------+------------+------------+-------------+
Truncated to displaylimit of 10.

In [36]:
%%sql 

SELECT e.id, e.first_name, e.last_name, s.salary
FROM employees AS e
INNER JOIN salaries AS s ON e.id = s.employee_id
ORDER BY s.salary DESC 
LIMIT 10;

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+------+-------------+-----------+--------+
|  id  |  first_name | last_name | salary |
+------+-------------+-----------+--------+
| 1406 |     John    |   Miller  | 99985  |
| 799  |     Jane    |    Lee    | 99968  |
| 1661 |     John    |   Brown   | 99922  |
| 1230 | Christopher |    Lee    | 99915  |
|  95  |    Sophia   |    Doe    | 99907  |
| 482  |    Olivia   |   Brown   | 99878  |
| 1241 |    Daniel   |  Johnson  | 99854  |
| 771  |    Robert   |    Lee    | 99809  |
| 502  |    Emily    |   Brown   | 99802  |
| 1103 |   Michael   |    Hall   | 99735  |
+------+-------------+-----------+--------+
Truncated to displaylimit of 10.

# **02 - Employee Count Across Departments**

In [39]:
%sql SELECT * FROM departments

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+----+--------------------------+
| id |           name           |
+----+--------------------------+
| 1  |     Human Resources      |
| 2  |         Finance          |
| 3  |        Marketing         |
| 4  |            IT            |
| 5  |        Operations        |
| 6  |          Sales           |
| 7  |     Customer Service     |
| 8  | Research and Development |
| 9  |          Legal           |
| 10 |      Administration      |
+----+--------------------------+
Truncated to displaylimit of 10.

In [41]:
%%sql 

SELECT d.name, COUNT(*) AS emp_count
FROM employees as e
INNER JOIN departments as d ON e.department_id = d.id
GROUP BY d.name
ORDER BY emp_count DESC

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+--------------------------+-----------+
|           name           | emp_count |
+--------------------------+-----------+
|          Sales           |    219    |
|          Legal           |    215    |
|     Human Resources      |    210    |
|     Customer Service     |    206    |
|         Finance          |    203    |
| Research and Development |    200    |
|        Marketing         |    197    |
|            IT            |    187    |
|      Administration      |    184    |
|        Operations        |    179    |
+--------------------------+-----------+
Truncated to displaylimit of 10.

# **03 - Avg. Salary Of Each Department**

In [45]:
%%sql 

SELECT d.name, COUNT(*) AS emp_count, ROUND(AVG(s.salary),0) AS avg_salary 
FROM employees AS e 
INNER JOIN departments as d ON e.department_id = d.id
INNER JOIN salaries as s ON e.id = s.employee_id
GROUP BY d.name
ORDER BY avg_salary DESC;

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+--------------------------+-----------+------------+
|           name           | emp_count | avg_salary |
+--------------------------+-----------+------------+
|        Marketing         |    197    |   76494    |
| Research and Development |    200    |   76457    |
|          Sales           |    219    |   76171    |
|            IT            |    187    |   76090    |
|     Customer Service     |    207    |   75044    |
|        Operations        |    179    |   75034    |
|          Legal           |    215    |   74841    |
|         Finance          |    204    |   74412    |
|     Human Resources      |    211    |   74342    |
|      Administration      |    184    |   72407    |
+--------------------------+-----------+------------+
Truncated to displaylimit of 10.

# **04 - Show Employees With Multiple Salaries**

## **Query 01**

In [54]:
%%sql 

SELECT e.id, e.first_name, e.last_name, COUNT(s.salary) AS num_salaries
FROM employees AS e 
INNER JOIN salaries AS s ON e.id = s.employee_id
GROUP BY e.id
HAVING COUNT(s.salary) > 1
ORDER BY num_salaries DESC

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

3 rows affected.

+----+-------------+-----------+--------------+
| id |  first_name | last_name | num_salaries |
+----+-------------+-----------+--------------+
| 20 | Christopher |   Smith   |      2       |
| 54 |    Robert   |   Smith   |      2       |
| 1  |   Samantha  |   Miller  |      2       |
+----+-------------+-----------+--------------+

## **Query 02**

* Nested Queries In WHERE Clause

In [59]:
%%sql 

SELECT e.id, e.first_name, e.last_name, s.salary
FROM employees AS e 
INNER JOIN salaries AS s ON e.id = s.employee_id
WHERE e.id IN ( SELECT s.employee_id 
                FROM salaries AS s
                GROUP BY s.employee_id 
                HAVING COUNT(s.salary) > 1)
ORDER BY e.id;

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

6 rows affected.

+----+-------------+-----------+--------+
| id |  first_name | last_name | salary |
+----+-------------+-----------+--------+
| 1  |   Samantha  |   Miller  | 60000  |
| 1  |   Samantha  |   Miller  | 54693  |
| 20 | Christopher |   Smith   | 55000  |
| 20 | Christopher |   Smith   | 50699  |
| 54 |    Robert   |   Smith   | 70000  |
| 54 |    Robert   |   Smith   | 67251  |
+----+-------------+-----------+--------+

# **05 - Employee Count By Job Title**

In [65]:
%sql SELECT * FROM employees

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

2000 rows affected.

+----+-------------+-----------+-----------------------------+------------+----------+---------------+
| id |  first_name | last_name |            email            | hire_date  | title_id | department_id |
+----+-------------+-----------+-----------------------------+------------+----------+---------------+
| 1  |   Samantha  |   Miller  | samantha.miller@example.com | 2022-06-18 |    3     |       2       |
| 2  |     John    |    Hall   |    john.hall@example.com    | 2021-11-19 |    3     |       8       |
| 3  |     Jane    |   Wilson  |   jane.wilson@example.com   | 2021-05-31 |    8     |       8       |
| 4  |   Michael   |  Johnson  | michael.johnson@example.com | 2023-06-21 |    5     |       8       |
| 5  |     John    |   Wilson  |   john.wilson@example.com   | 2022-06-05 |    10    |       6       |
| 6  |   Samantha  |   Miller  | samantha.miller@example.com | 2023-01-28 |    2     |       5       |
| 7  |    Daniel   |   Miller  |  daniel.miller@example.com  | 2021-04-13 |    10    |       10      |
| 8  | Christopher |    Lee    | christopher.lee@example.com | 2020-02-21 |    6     |       8       |
| 9  |    Emily    |    Lee    |    emily.lee@example.com    | 2019-06-05 |    6     |       9       |
| 10 |    Olivia   |   Smith   |   olivia.smith@example.com  | 2023-06-30 |    4     |       6       |
+----+-------------+-----------+-----------------------------+------------+----------+---------------+
Truncated to displaylimit of 10.

In [68]:
%%sql 

SELECT t.name, COUNT(*) AS emp_count
FROM employees AS e
INNER JOIN titles AS t ON e.title_id = t.id
GROUP BY t.name
ORDER BY emp_count DESC;

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+-------------------+-----------+
|        name       | emp_count |
+-------------------+-----------+
|   IT Consultant   |    216    |
|     QA Tester     |    209    |
|   UI/UX Designer  |    204    |
| Software Engineer |    203    |
|  Project Manager  |    200    |
|  Network Engineer |    200    |
|  Business Analyst |    197    |
|   Database Admin  |    196    |
|   System Analyst  |    195    |
|    Data Analyst   |    180    |
+-------------------+-----------+
Truncated to displaylimit of 10.

# **06 - Avg Salary By Job Title**

In [73]:
%%sql 

SELECT t.name, COUNT(*) AS emp_count, ROUND(AVG(s.salary),0) AS avg_salary
FROM employees AS e
INNER JOIN titles AS t ON e.title_id = t.id
INNER JOIN salaries AS s ON e.id = s.employee_id
GROUP BY t.name
ORDER BY avg_salary DESC;

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

10 rows affected.

+-------------------+-----------+------------+
|        name       | emp_count | avg_salary |
+-------------------+-----------+------------+
|  Network Engineer |    200    |   76731    |
|   System Analyst  |    195    |   76050    |
|    Data Analyst   |    181    |   75315    |
|   UI/UX Designer  |    204    |   75157    |
|   Database Admin  |    196    |   74921    |
| Software Engineer |    204    |   74848    |
|   IT Consultant   |    216    |   74772    |
|     QA Tester     |    209    |   74707    |
|  Business Analyst |    197    |   74685    |
|  Project Manager  |    201    |   74354    |
+-------------------+-----------+------------+
Truncated to displaylimit of 10.

# **07 - How Has The Avg Salary Changed Over Time?**

In [78]:
%%sql 

SELECT extract(year from s.start_date) AS year, ROUND(AVG(s.salary),0) AS avg_salary
FROM salaries as s
GROUP BY year
ORDER BY year ASC;

Running query in 'postgresql://postgres:***@localhost:5432/HR_Database'

6 rows affected.

+------+------------+
| year | avg_salary |
+------+------------+
| 2018 |   76224    |
| 2019 |   76387    |
| 2020 |   75804    |
| 2021 |   74341    |
| 2022 |   74334    |
| 2023 |   74601    |
+------+------------+